alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1200.svd
<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<!-- edited with XMLSpy v2013 sp1 (http://www.altova.com) by XMLSpy 2014 Professional Ed. Release 2, Installed for 180 users (with SMP from 2014-10-06 to 2016-10-06) (Infineon Technologies AG) -->
<!--/*****************************************************************************
 *
 * Copyright (C) 2016 Infineon Technologies AG. All rights reserved.
 *
 * Infineon Technologies AG (Infineon) is supplying this software for use with
 * Infineon's microcontrollers.  This file can be freely distributed within 
 * development tools that are supporting such microcontrollers. 
 *
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * INFINEON SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL,
 * OR CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************-->
<!--edited with XMLSpy v2014 sp1 (http://www.altova.com) by Infineon Technologies AG (Infineon Technologies AG) -->
<!--Version of used XSLT processor: 1 Altova GmbH http://www.altova.com-->
<!--Version of used XSLT: ISFR2SVD.xslt  V0.8-->
<!--Configuration of XSLT: with bit extraction =Yes;  with bit coding =Yes; decodeThe3knownBitAccessTypes = Yes; 0,r and 1,r bit extraction = No-->
<!--Version of used XSLT for fixing SVD issues: SVD_fixes.xslt  V1.2-->
<device xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" schemaVersion="1.2" xs:noNamespaceSchemaLocation="c:\fm8_xml\XSLT\RD2ISFR\CMSIS-SVD.xsd">
	<vendor>Infineon</vendor>
	<name>XMC1200</name>
	<version>1.3.0 (Reference Manual v1.3)</version>
	<description>SVD file</description>
	<!--Compliance
- CMSIS-SVD V1.2
- Tested with ARM CMSIS-SVD SVD Consistency Checker / Header File Generator V2.87l (lowercase L)
-->
	<!--Release Notes
-->
	<!--V1.3.0 (22Aug2016)
- Bit field WS added to NVMCONF register of NVM unit
- Added CONFIG1 register to NVM unit
-->
	<!--Release History
-->
	<!--V1.2.3 (22Feb2016)
- Switch to SVD scheme V1.2
- Corrected size attribute of addressBlock element of SCU_INTERRUPT block
- Added service request information to "interrupt" elements
-->
	<!--V1.2.2 (22Jan2015)
- PCR.SLPHSEL [SSC mode] is added
-->
	<!--V1.2.1 (12Jan2015)
- Replaced binary number identifiers (0b) by (#)
-->
	<!--V1.2 (03Dec2014)
- The reset value for SCU_DBGROMID is updated
- The description for PRNG bit fields are updated
- Missing bit field enumerations in CCU4.CC4xINS registers are added
- PCx bit field enumerations in PORTy.IOCRz registers are added
- Element <readAction>modifyExternal</readAction> is added to registers where debugger read access can cause side effects:
  => USIC registers OUTR, RBUF (debugger use OUTDR, RBUFD)
  => VADC registers GLOBRES, RES (debugger use GLOBRESD, RESD)
  => CCU4 registers C0V, C1V, C2V, C3V, ECRD0, ECRD1
- Removed "Reserved" enumeration values
-->
	<!--V1.1 (23Apr2014)
- SCU_ANAOFFSET.ADJL_OFFSET bit field description is updated
- The reset value for USIC0_CH0_CCFG is updated
- USIC0_DXyCR.SFSEL bit description is updated
- VADC_GLOBCFG.DIVA bit description is updated  
- VADC_CHCTR.REFSEL bit description is updated
- SHS0_CALOC0 and  SHS0_CALOC1 are added
- Port2_PDISC.PDIS bit description is updated
-->
	<!--V1.0.7 (21Jan2014)
- BCCU0_CHCONFIGx.DBP bitname has been updated to Dimming Input Bypass
- Added 3 new bits (read-only) in PAU_AVAIL0 register
- PORT1 registers have been updated to support P1.6 in VQFN40 pin package, pending to be updated in RM V1.1 
-->
	<!--V1.0.6 (19Mar2013)
- ACMP registers offset address are updated
- ADC register bit definition of CHCTRx.BWDCH, SHSCFG.AREF, GLOBEVNP.REV0NP and SRACT.ASSR2/3 are updated
-->
	<!--V1.0.5 (04Feb2013)
- rename VADC0 to VADC under the "name" and "derivedFrom" column
-->
	<!--V1.0.4 (30012013)
- Update SVD based on latest XMC1200 RM version
- Grouping for SCU is updated (SCU_CLK, SCU_INTERRUPT)
- Added the COMPARATOR group which consist of ORC and ACMP registers
- Update the VADC grouping to align with the XMC4000 VADC
- HIde some bits in PAU, SCU registers that are related to modules that are not available in this variants  
-->
	<!--V1.0.3 (30112012)
- Update SVD to 3 series and update MATH to 1 group instead of 3 groups
-->
	<!--V1.0.2 (16102012)
-  Added the VADC0 and SHS0 registers
-->
	<!--V1.0.1 
- first working version, VADC/SHS register is missing
-->
	<cpu>
		<name>CM0</name>
		<revision>r0p0</revision>
		<endian>little</endian>
		<mpuPresent>false</mpuPresent>
		<fpuPresent>false</fpuPresent>
		<nvicPrioBits>2</nvicPrioBits>
		<vendorSystickConfig>false</vendorSystickConfig>
	</cpu>
	<addressUnitBits>8</addressUnitBits>
	<width>32</width>
	<peripherals>
		<peripheral>
			<name>PPB</name>
			<description>Cortex-M0 Private Peripheral Block</description>
			<baseAddress>0xE000E000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x1000</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>SYST_CSR</name>
					<description>SysTick Control and Status Register</description>
					<addressOffset>0x0010</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>ENABLE</name>
							<description>Counter Enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Counter disabled.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counter enabled.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>TICKINT</name>
							<description>SysTick Exception Request</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Counting down to zero does not assert the SysTick exception request.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Counting down to zero to assert the SysTick exception request.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CLKSOURCE</name>
							<description>Clock Source</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>External clock.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Processor clock.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>COUNTFLAG</name>
							<description>Counter Flag</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_RVR</name>
					<description>SysTick Reload Value Register</description>
					<addressOffset>0x0014</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>RELOAD</name>
							<description>Reload Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CVR</name>
					<description>SysTick Current Value Register</description>
					<addressOffset>0x0018</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0x00000000</resetMask>
					<fields>
						<field>
							<name>CURRENT</name>
							<description>SysTick Counter Current Value</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>SYST_CALIB</name>
					<description>SysTick Calibration Value Register</description>
					<addressOffset>0x001C</addressOffset>
					<size>32</size>
					<resetValue>0x40000147</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>TENMS</name>
							<description>10 Milliseconds</description>
							<lsb>0</lsb>
							<msb>23</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>SKEW</name>
							<description>Clock Skew</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
						</field>
						<field>
							<name>NOREF</name>
							<description>Reference Clock</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISER</name>
					<description>Interrupt Set-enable Register</description>
					<addressOffset>0x0100</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETENA</name>
							<description>Interrupt Node Set-enable</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node disabled. Write: No effect.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node enabled. Write: Enable interrupt node</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICER</name>
					<description>IInterrupt Clear-enable Register</description>
					<addressOffset>0x0180</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRENA</name>
							<description>Interrupt Node Clear-enable</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node disabled. Write: No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node enabled. Write: Disable interrupt node.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ISPR</name>
					<description>Interrupt Set-pending Register</description>
					<addressOffset>0x0200</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>SETPEND</name>
							<description>Interrupt Node Set-pending</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node is not pending. Write: No effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node is pending. Write: Change interrupt state to pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_ICPR</name>
					<description>Interrupt Clear-pending Register</description>
					<addressOffset>0x0280</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>CLRPEND</name>
							<description>Interrupt Node Clear-pending</description>
							<lsb>0</lsb>
							<msb>31</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Read: Interrupt node is not pending. Write: No effect.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Read: Interrupt node is pending. Write: Remove interrupt state from pending.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR0</name>
					<description>Interrupt Priority Register 0</description>
					<addressOffset>0x0400</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR1</name>
					<description>Interrupt Priority Register 1</description>
					<addressOffset>0x0404</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR2</name>
					<description>Interrupt Priority Register 2</description>
					<addressOffset>0x0408</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR3</name>
					<description>Interrupt Priority Register 3</description>
					<addressOffset>0x040C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR4</name>
					<description>Interrupt Priority Register 4</description>
					<addressOffset>0x0410</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR5</name>
					<description>Interrupt Priority Register 5</description>
					<addressOffset>0x0414</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR6</name>
					<description>Interrupt Priority Register 6</description>
					<addressOffset>0x0418</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>NVIC_IPR7</name>
					<description>Interrupt Priority Register 7</description>
					<addressOffset>0x041C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>PRI_3</name>
							<description>Priority, Byte Offset 3</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_2</name>
							<description>Priority, Byte Offset 2</description>
							<lsb>16</lsb>
							<msb>23</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_1</name>
							<description>Priority, Byte Offset 1</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>PRI_0</name>
							<description>Priority, Byte Offset 0</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>CPUID</name>
					<description>CPUID Base Register</description>
					<addressOffset>0x0D00</addressOffset>
					<size>32</size>
					<resetValue>0x410CC200</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>Revision</name>
							<description>Revision Number</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Patch 0</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PartNo</name>
							<description>Part Number of the Processor</description>
							<lsb>4</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Cortex-M0</description>
									<value>0xC20</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Architecture</name>
							<description>Architecture</description>
							<lsb>16</lsb>
							<msb>19</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ARMv6-M</description>
									<value>0xC</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Variant</name>
							<description>Variant Number</description>
							<lsb>20</lsb>
							<msb>23</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Revision 0</description>
									<value>0x0</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>Implementer</name>
							<description>Implementer Code</description>
							<lsb>24</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>ARM</description>
									<value>0x41</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
