alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1200.svd
				<register>
					<name>DX0CR</name>
					<description>Input Control Register 0</description>
					<addressOffset>0x01C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSEL</name>
							<description>Data Selection for Input Signal</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data input DXnA is selected.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data input DXnB is selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The data input DXnC is selected.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The data input DXnD is selected.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>The data input DXnE is selected.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>The data input DXnF is selected.</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>The data input DXnG is selected.</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>The data input is always 1.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSW</name>
							<description>Input Switch</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input of the data shift unit is controlled by the protocol pre-processor.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input of the data shift unit is connected to the selected data input line. This setting is used if the signals are directly derived from an input pin without treatment by the protocol pre-processor.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFEN</name>
							<description>Digital Filter Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not digitally filtered.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is digitally filtered.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSEN</name>
							<description>Data Synchronization Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The un-synchronized signal can be taken as input for the data shift unit.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The synchronized signal can be taken as input for the data shift unit.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPOL</name>
							<description>Data Polarity for DXn</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not inverted.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is inverted.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SFSEL</name>
							<description>Sampling Frequency Selection</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The sampling frequency is fPERIPH.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The sampling frequency is fFD.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM</name>
							<description>Combination Mode</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The trigger activation is disabled.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A rising edge activates DXnT.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>A falling edge activates DXnT.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Both edges activate DXnT.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DXS</name>
							<description>Synchronized Data Value</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The current value of DXnS is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The current value of DXnS is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DX1CR</name>
					<description>Input Control Register 1</description>
					<addressOffset>0x020</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSEL</name>
							<description>Data Selection for Input Signal</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data input DX1A is selected.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data input DX1B is selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The data input DX1C is selected.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The data input DX1D is selected.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>The data input DX1E is selected.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>The data input DX1F is selected.</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>The data input DX1G is selected.</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>The data input is always 1.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DCEN</name>
							<description>Delay Compensation Enable</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The receive shift clock is dependent on INSW selection.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The receive shift clock is connected to the selected data input line. This setting is used if delay compensation is required in SSC and IIS protocols, else DCEN should always be 0.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSW</name>
							<description>Input Switch</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input of the data shift unit is controlled by the protocol pre-processor.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input of the data shift unit is connected to the selected data input line. This setting is used if the signals are directly derived from an input pin without treatment by the protocol pre-processor.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFEN</name>
							<description>Digital Filter Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not digitally filtered.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is digitally filtered.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSEN</name>
							<description>Data Synchronization Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The un-synchronized signal can be taken as input for the data shift unit.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The synchronized signal can be taken as input for the data shift unit.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPOL</name>
							<description>Data Polarity for DXn</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not inverted.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is inverted.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SFSEL</name>
							<description>Sampling Frequency Selection</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The sampling frequency is fPERIPH.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The sampling frequency is fFD.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM</name>
							<description>Combination Mode</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The trigger activation is disabled.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A rising edge activates DX1T.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>A falling edge activates DX1T.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Both edges activate DX1T.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DXS</name>
							<description>Synchronized Data Value</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The current value of DX1S is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The current value of DX1S is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>DX2CR</name>
					<description>Input Control Register 2</description>
					<addressOffset>0x024</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>DSEL</name>
							<description>Data Selection for Input Signal</description>
							<lsb>0</lsb>
							<msb>2</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The data input DXnA is selected.</description>
									<value>#000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The data input DXnB is selected.</description>
									<value>#001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>The data input DXnC is selected.</description>
									<value>#010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>The data input DXnD is selected.</description>
									<value>#011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>The data input DXnE is selected.</description>
									<value>#100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>The data input DXnF is selected.</description>
									<value>#101</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>The data input DXnG is selected.</description>
									<value>#110</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value8</name>
									<description>The data input is always 1.</description>
									<value>#111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>INSW</name>
							<description>Input Switch</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input of the data shift unit is controlled by the protocol pre-processor.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input of the data shift unit is connected to the selected data input line. This setting is used if the signals are directly derived from an input pin without treatment by the protocol pre-processor.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DFEN</name>
							<description>Digital Filter Enable</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not digitally filtered.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is digitally filtered.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DSEN</name>
							<description>Data Synchronization Enable</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The un-synchronized signal can be taken as input for the data shift unit.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The synchronized signal can be taken as input for the data shift unit.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DPOL</name>
							<description>Data Polarity for DXn</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The input signal is not inverted.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The input signal is inverted.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>SFSEL</name>
							<description>Sampling Frequency Selection</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The sampling frequency is fPERIPH.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The sampling frequency is fFD.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CM</name>
							<description>Combination Mode</description>
							<lsb>10</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The trigger activation is disabled.</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>A rising edge activates DXnT.</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>A falling edge activates DXnT.</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Both edges activate DXnT.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>DXS</name>
							<description>Synchronized Data Value</description>
							<lsb>15</lsb>
							<msb>15</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>The current value of DXnS is 0.</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>The current value of DXnS is 1.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
