alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1200.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_POWER</name>
			<description>System Control Unit</description>
			<baseAddress>0x40010200</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x0100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>VDESR</name>
					<description>Voltage Detector Status Register</description>
					<addressOffset>0x0000</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VCLIP</name>
							<description>VCLIP Indication</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VCLIP is not active</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VCLIP is active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDPPW</name>
							<description>VDDPPW Indication</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDP is above pre-warning threshold</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDP is below pre-warningthreshold</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_CLK</name>
			<description>System Control Unit</description>
			<baseAddress>0x40010300</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>CLKCR</name>
					<description>Clock Control Register</description>
					<addressOffset>0x00</addressOffset>
					<size>32</size>
					<resetValue>0x3FF00400</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FDIV</name>
							<description>Fractional Divider Selection</description>
							<lsb>0</lsb>
							<msb>7</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>IDIV</name>
							<description>Divider Selection</description>
							<lsb>8</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Divider is bypassed.</description>
									<value>0x00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>1; MCLK = 32 MHz</description>
									<value>0x01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>2; MCLK = 16 MHz</description>
									<value>0x02</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>3; MCLK = 10.67 MHz</description>
									<value>0x03</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>4; MCLK = 8 MHz</description>
									<value>0x04</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>254; MCLK = 126 kHz</description>
									<value>0xFE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>255; MCLK = 125.5 kHz</description>
									<value>0xFF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>PCLKSEL</name>
							<description>PCLK Clock Select</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>PCLK = MCLK</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>PCLK = 2 x MCLK</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTCCLKSEL</name>
							<description>RTC Clock Select</description>
							<lsb>17</lsb>
							<msb>19</msb>
							<access>read-write</access>
						</field>
						<field>
							<name>CNTADJ</name>
							<description>Counter Adjustment</description>
							<lsb>20</lsb>
							<msb>29</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>1 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>2 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>3 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x002</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>4 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x003</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>5 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x004</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value6</name>
									<description>1023 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x3FE</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value7</name>
									<description>1024 clock cycles of the DCO1, 64MHz clock</description>
									<value>0x3FF</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDC2LOW</name>
							<description>VDDC too low</description>
							<lsb>30</lsb>
							<msb>30</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDC is not too low and the fractional divider input clock is running at the targeted frequency</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDC is too low and the fractional divider input clock is not running at the targeted frequency</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDDC2HIGH</name>
							<description>VDDC too high</description>
							<lsb>31</lsb>
							<msb>31</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDDC is not too high</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDDC is too high</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>PWRSVCR</name>
					<description>Power Save Control Register</description>
					<addressOffset>0x04</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>FPD</name>
							<description>Flash Power Down</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Flash power down when entering power save mode. Upon wake-up, CPU is able to fetch code from flash.</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CGATSTAT0</name>
					<description>Peripheral 0 Clock Gating Status</description>
					<addressOffset>0x08</addressOffset>
					<size>32</size>
					<resetValue>0x000007FF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VADC</name>
							<description>VADC and SHS Gating Status</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU40</name>
							<description>CCU40 Gating Status</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USIC0</name>
							<description>USIC0 Gating Status</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCCU0</name>
							<description>BCCU0 Gating Status</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS0</name>
							<description>LEDTS0 Gating Status</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS1</name>
							<description>LEDTS1 Gating Status</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>WDT Gating Status</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC</name>
							<description>RTC Gating Status</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>gating de-asserted</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>gating asserted</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CGATSET0</name>
					<description>Peripheral 0 Clock Gating Set</description>
					<addressOffset>0x0C</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VADC</name>
							<description>VADC and SHS Gating Set</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU40</name>
							<description>CCU40 Gating Set</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USIC0</name>
							<description>USIC0 Gating Set</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCCU0</name>
							<description>BCCU0 Gating Set</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS0</name>
							<description>LEDTS0 Gating Set</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS1</name>
							<description>LEDTS1 Gating Set</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>WDT Gating Set</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC</name>
							<description>RTC Gating Set</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>enable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>CGATCLR0</name>
					<description>Peripheral 0 Clock Gating Clear</description>
					<addressOffset>0x10</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>VADC</name>
							<description>VADC and SHS Gating Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>CCU40</name>
							<description>CCU40 Gating Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>USIC0</name>
							<description>USIC0 Gating Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BCCU0</name>
							<description>BCCU0 Gating Clear</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS0</name>
							<description>LEDTS0 Gating Clear</description>
							<lsb>5</lsb>
							<msb>5</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>LEDTS1</name>
							<description>LEDTS1 Gating Clear</description>
							<lsb>6</lsb>
							<msb>6</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>WDT</name>
							<description>WDT Gating Clear</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>RTC</name>
							<description>RTC Gating Clear</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>no effect</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>disable gating</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
