alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1200.svd
			</registers>
		</peripheral>
		<peripheral>
			<name>SCU_ANALOG</name>
			<description>System Control Unit</description>
			<groupName>SCU</groupName>
			<baseAddress>0x40011000</baseAddress>
			<addressBlock>
				<offset>0x0</offset>
				<size>0x100</size>
				<usage>registers</usage>
			</addressBlock>
			<registers>
				<register>
					<name>ANATSECTRL</name>
					<description>Temperature Sensor Control Register</description>
					<addressOffset>0x24</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_EN</name>
							<description>Temperature sensor enable</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Temperature sensor is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Temperature sensor is switched on</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEIH</name>
					<description>Temperature Sensor High Temperature Interrupt Register</description>
					<addressOffset>0x30</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_IH</name>
							<description>Counter value for high temperature interrupt</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEIL</name>
					<description>Temperature Sensor Low Temperature Interrupt Register</description>
					<addressOffset>0x34</addressOffset>
					<size>16</size>
					<resetValue>0xFFFF</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_IL</name>
							<description>Counter value for low temperature interrupt</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-write</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANATSEMON</name>
					<description>Temperature Sensor Counter2 Monitor Register</description>
					<addressOffset>0x40</addressOffset>
					<size>16</size>
					<resetValue>0x0000</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>TSE_MON</name>
							<description>Monitor Counter2 value; loaded by TSE_DONE</description>
							<lsb>0</lsb>
							<msb>15</msb>
							<access>read-only</access>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAVDEL</name>
					<description>Voltage Detector Control Register</description>
					<addressOffset>0x50</addressOffset>
					<size>16</size>
					<resetValue>0x001C</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>VDEL_SELECT</name>
							<description>VDEL Range Select</description>
							<lsb>0</lsb>
							<msb>1</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>2.25V</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>3.0V</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>4.4V</description>
									<value>#10</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDEL_TIM_ADJ</name>
							<description>VDEL Timing Setting</description>
							<lsb>2</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>typ 1us - slowest response time</description>
									<value>#00</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>typ 500n</description>
									<value>#01</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>typ 250n</description>
									<value>#10</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>no delay - fastest response time.</description>
									<value>#11</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>VDEL_EN</name>
							<description>VDEL unit Enable</description>
							<lsb>4</lsb>
							<msb>4</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>VDEL is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>VDEL is active</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>ANAOFFSET</name>
					<description>DCO1 Offset Register</description>
					<addressOffset>0x6C</addressOffset>
					<size>16</size>
					<resetValue>0x0004</resetValue>
					<resetMask>0xFFFF</resetMask>
					<fields>
						<field>
							<name>ADJL_OFFSET</name>
							<description>ADJL Offset register</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>- 3.75%, typ.</description>
									<value>0x0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>- 2.85%, typ.</description>
									<value>0x1</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>0, default</description>
									<value>0x4</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>+ 0.95%, typ.</description>
									<value>0x5</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>+ 3.75%, typ.</description>
									<value>0x8</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
