alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/SVD/XMC1200.svd
				<register>
					<name>BFL</name>
					<description>Boundary Flag Register</description>
					<addressOffset>0x00C8</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BFL0</name>
							<description>Boundar0 Flag y</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive state: result has not yet crossed the activation boundary (see bitfield BFAy), or selected gate signal is inactive, or this boundary flag is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active state: result has crossed the activation boundary</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL1</name>
							<description>Boundar1 Flag y</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive state: result has not yet crossed the activation boundary (see bitfield BFAy), or selected gate signal is inactive, or this boundary flag is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active state: result has crossed the activation boundary</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL2</name>
							<description>Boundar2 Flag y</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive state: result has not yet crossed the activation boundary (see bitfield BFAy), or selected gate signal is inactive, or this boundary flag is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active state: result has crossed the activation boundary</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL3</name>
							<description>Boundar3 Flag y</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>read-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Passive state: result has not yet crossed the activation boundary (see bitfield BFAy), or selected gate signal is inactive, or this boundary flag is disabled</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Active state: result has crossed the activation boundary</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFA0</name>
							<description>Boundar0 Flag y Activation Select</description>
							<lsb>8</lsb>
							<msb>8</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Set boundary flag BFLy if result is above the defined band or compare value, clear if below</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set boundary flag BFLy if result is below the defined band or compare value, clear if above</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFA1</name>
							<description>Boundar1 Flag y Activation Select</description>
							<lsb>9</lsb>
							<msb>9</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Set boundary flag BFLy if result is above the defined band or compare value, clear if below</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set boundary flag BFLy if result is below the defined band or compare value, clear if above</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFA2</name>
							<description>Boundar2 Flag y Activation Select</description>
							<lsb>10</lsb>
							<msb>10</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Set boundary flag BFLy if result is above the defined band or compare value, clear if below</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set boundary flag BFLy if result is below the defined band or compare value, clear if above</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFA3</name>
							<description>Boundar3 Flag y Activation Select</description>
							<lsb>11</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Set boundary flag BFLy if result is above the defined band or compare value, clear if below</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set boundary flag BFLy if result is below the defined band or compare value, clear if above</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFI0</name>
							<description>Boundar0 Flag y Inversion Control</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use BFLy directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Invert value and use BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFI1</name>
							<description>Boundar1 Flag y Inversion Control</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use BFLy directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Invert value and use BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFI2</name>
							<description>Boundar2 Flag y Inversion Control</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use BFLy directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Invert value and use BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFI3</name>
							<description>Boundar3 Flag y Inversion Control</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Use BFLy directly</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Invert value and use BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BFLS</name>
					<description>Boundary Flag Software Register</description>
					<addressOffset>0x00CC</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BFC0</name>
							<description>Boundar0 Flag y Clear</description>
							<lsb>0</lsb>
							<msb>0</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFC1</name>
							<description>Boundar1 Flag y Clear</description>
							<lsb>1</lsb>
							<msb>1</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFC2</name>
							<description>Boundar2 Flag y Clear</description>
							<lsb>2</lsb>
							<msb>2</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFC3</name>
							<description>Boundar3 Flag y Clear</description>
							<lsb>3</lsb>
							<msb>3</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Clear bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFS0</name>
							<description>Boundar0 Flag y Set</description>
							<lsb>16</lsb>
							<msb>16</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFS1</name>
							<description>Boundar1 Flag y Set</description>
							<lsb>17</lsb>
							<msb>17</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFS2</name>
							<description>Boundar2 Flag y Set</description>
							<lsb>18</lsb>
							<msb>18</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFS3</name>
							<description>Boundar3 Flag y Set</description>
							<lsb>19</lsb>
							<msb>19</msb>
							<access>write-only</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>No action</description>
									<value>#0</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Set bit BFLy</description>
									<value>#1</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BFLC</name>
					<description>Boundary Flag Control Register</description>
					<addressOffset>0x00D0</addressOffset>
					<size>32</size>
					<resetValue>0x00000000</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BFM0</name>
							<description>Boundary Flag y Mode Control</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disable boundary flag, BFLy is not changed</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Always enable boundary flag (follow compare results)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Enable boundary flag while gate of source 0 is active, clear BFLy while gate is inactive</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Enable boundary flag while gate of source 1 is active, clear BFLy while gate is inactive</description>
									<value>#0011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFM1</name>
							<description>Boundary Flag y Mode Control</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disable boundary flag, BFLy is not changed</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Always enable boundary flag (follow compare results)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Enable boundary flag while gate of source 0 is active, clear BFLy while gate is inactive</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Enable boundary flag while gate of source 1 is active, clear BFLy while gate is inactive</description>
									<value>#0011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFM2</name>
							<description>Boundary Flag y Mode Control</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disable boundary flag, BFLy is not changed</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Always enable boundary flag (follow compare results)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Enable boundary flag while gate of source 0 is active, clear BFLy while gate is inactive</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Enable boundary flag while gate of source 1 is active, clear BFLy while gate is inactive</description>
									<value>#0011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFM3</name>
							<description>Boundary Flag y Mode Control</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Disable boundary flag, BFLy is not changed</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Always enable boundary flag (follow compare results)</description>
									<value>#0001</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Enable boundary flag while gate of source 0 is active, clear BFLy while gate is inactive</description>
									<value>#0010</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Enable boundary flag while gate of source 1 is active, clear BFLy while gate is inactive</description>
									<value>#0011</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
				<register>
					<name>BFLNP</name>
					<description>Boundary Flag Node Pointer Register</description>
					<addressOffset>0x00D4</addressOffset>
					<size>32</size>
					<resetValue>0x0000FFFF</resetValue>
					<resetMask>0xFFFFFFFF</resetMask>
					<fields>
						<field>
							<name>BFL0NP</name>
							<description>Boundary Flag y Node Pointer</description>
							<lsb>0</lsb>
							<msb>3</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select common bondary flag output 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select common bondary flag output 3</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select common service request line C0SR0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select common service request line C0SR3</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Disabled, no common output signal</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL1NP</name>
							<description>Boundary Flag y Node Pointer</description>
							<lsb>4</lsb>
							<msb>7</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select common bondary flag output 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select common bondary flag output 3</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select common service request line C0SR0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select common service request line C0SR3</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Disabled, no common output signal</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL2NP</name>
							<description>Boundary Flag y Node Pointer</description>
							<lsb>8</lsb>
							<msb>11</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select common bondary flag output 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select common bondary flag output 3</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select common service request line C0SR0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select common service request line C0SR3</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Disabled, no common output signal</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
						<field>
							<name>BFL3NP</name>
							<description>Boundary Flag y Node Pointer</description>
							<lsb>12</lsb>
							<msb>15</msb>
							<access>read-write</access>
							<enumeratedValues>
								<enumeratedValue>
									<name>value1</name>
									<description>Select common bondary flag output 0</description>
									<value>#0000</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value2</name>
									<description>Select common bondary flag output 3</description>
									<value>#0011</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value3</name>
									<description>Select common service request line C0SR0</description>
									<value>#0100</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value4</name>
									<description>Select common service request line C0SR3</description>
									<value>#0111</value>
								</enumeratedValue>
								<enumeratedValue>
									<name>value5</name>
									<description>Disabled, no common output signal</description>
									<value>#1111</value>
								</enumeratedValue>
							</enumeratedValues>
						</field>
					</fields>
				</register>
